{"module": "keras.src.models.functional", "class_name": "Functional", "config": {"name": "functional_120", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 365, 5], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer_9", "optional": false}, "registered_name": null, "name": "input_layer_9", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_69", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false, "renorm": false, "renorm_clipping": null, "renorm_momentum": 0.99}, "registered_name": null, "build_config": {"input_shape": [null, 365, 5]}, "name": "batch_normalization_69", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 5], "dtype": "float32", "keras_history": ["input_layer_9", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_86", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 84, "kernel_size": [29], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "LecunUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 365, 5]}, "name": "conv1d_86", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 5], "dtype": "float32", "keras_history": ["batch_normalization_69", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_70", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false, "renorm": false, "renorm_clipping": null, "renorm_momentum": 0.99}, "registered_name": null, "build_config": {"input_shape": [null, 365, 84]}, "name": "batch_normalization_70", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 84], "dtype": "float32", "keras_history": ["conv1d_86", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_21", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "name": "re_lu_21", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 84], "dtype": "float32", "keras_history": ["batch_normalization_70", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_87", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 84, "kernel_size": [29], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "LecunUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 365, 84]}, "name": "conv1d_87", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 84], "dtype": "float32", "keras_history": ["re_lu_21", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_71", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false, "renorm": false, "renorm_clipping": null, "renorm_momentum": 0.99}, "registered_name": null, "build_config": {"input_shape": [null, 365, 84]}, "name": "batch_normalization_71", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 84], "dtype": "float32", "keras_history": ["conv1d_87", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_22", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "name": "re_lu_22", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 84], "dtype": "float32", "keras_history": ["batch_normalization_71", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_88", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 84, "kernel_size": [29], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "LecunUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 365, 84]}, "name": "conv1d_88", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 84], "dtype": "float32", "keras_history": ["re_lu_22", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_72", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false, "renorm": false, "renorm_clipping": null, "renorm_momentum": 0.99}, "registered_name": null, "build_config": {"input_shape": [null, 365, 84]}, "name": "batch_normalization_72", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 84], "dtype": "float32", "keras_history": ["conv1d_88", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_23", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "name": "re_lu_23", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 84], "dtype": "float32", "keras_history": ["batch_normalization_72", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_89", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 84, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "LecunUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 365, 84]}, "name": "conv1d_89", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 84], "dtype": "float32", "keras_history": ["re_lu_23", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_10", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 365, 84], [null, 365, 84]]}, "name": "add_10", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 84], "dtype": "float32", "keras_history": ["re_lu_23", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 84], "dtype": "float32", "keras_history": ["conv1d_89", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_90", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 118, "kernel_size": [20], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "LecunUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 365, 84]}, "name": "conv1d_90", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 84], "dtype": "float32", "keras_history": ["add_10", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_73", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false, "renorm": false, "renorm_clipping": null, "renorm_momentum": 0.99}, "registered_name": null, "build_config": {"input_shape": [null, 365, 118]}, "name": "batch_normalization_73", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 118], "dtype": "float32", "keras_history": ["conv1d_90", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_24", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "name": "re_lu_24", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 118], "dtype": "float32", "keras_history": ["batch_normalization_73", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_91", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 118, "kernel_size": [20], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "LecunUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 365, 118]}, "name": "conv1d_91", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 118], "dtype": "float32", "keras_history": ["re_lu_24", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_74", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false, "renorm": false, "renorm_clipping": null, "renorm_momentum": 0.99}, "registered_name": null, "build_config": {"input_shape": [null, 365, 118]}, "name": "batch_normalization_74", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 118], "dtype": "float32", "keras_history": ["conv1d_91", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_25", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "name": "re_lu_25", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 118], "dtype": "float32", "keras_history": ["batch_normalization_74", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_92", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 118, "kernel_size": [20], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "LecunUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 365, 118]}, "name": "conv1d_92", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 118], "dtype": "float32", "keras_history": ["re_lu_25", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_75", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false, "renorm": false, "renorm_clipping": null, "renorm_momentum": 0.99}, "registered_name": null, "build_config": {"input_shape": [null, 365, 118]}, "name": "batch_normalization_75", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 118], "dtype": "float32", "keras_history": ["conv1d_92", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_26", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "name": "re_lu_26", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 118], "dtype": "float32", "keras_history": ["batch_normalization_75", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_93", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 118, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "LecunUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 365, 118]}, "name": "conv1d_93", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 118], "dtype": "float32", "keras_history": ["re_lu_26", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_11", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 365, 118], [null, 365, 118]]}, "name": "add_11", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 118], "dtype": "float32", "keras_history": ["re_lu_26", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 118], "dtype": "float32", "keras_history": ["conv1d_93", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_94", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 167, "kernel_size": [14], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "LecunUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 365, 118]}, "name": "conv1d_94", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 118], "dtype": "float32", "keras_history": ["add_11", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_76", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false, "renorm": false, "renorm_clipping": null, "renorm_momentum": 0.99}, "registered_name": null, "build_config": {"input_shape": [null, 365, 167]}, "name": "batch_normalization_76", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 167], "dtype": "float32", "keras_history": ["conv1d_94", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_27", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "name": "re_lu_27", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 167], "dtype": "float32", "keras_history": ["batch_normalization_76", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_95", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 167, "kernel_size": [14], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "LecunUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 365, 167]}, "name": "conv1d_95", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 167], "dtype": "float32", "keras_history": ["re_lu_27", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_77", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false, "renorm": false, "renorm_clipping": null, "renorm_momentum": 0.99}, "registered_name": null, "build_config": {"input_shape": [null, 365, 167]}, "name": "batch_normalization_77", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 167], "dtype": "float32", "keras_history": ["conv1d_95", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_28", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "name": "re_lu_28", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 167], "dtype": "float32", "keras_history": ["batch_normalization_77", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_96", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 167, "kernel_size": [14], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "LecunUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 365, 167]}, "name": "conv1d_96", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 167], "dtype": "float32", "keras_history": ["re_lu_28", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_78", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false, "renorm": false, "renorm_clipping": null, "renorm_momentum": 0.99}, "registered_name": null, "build_config": {"input_shape": [null, 365, 167]}, "name": "batch_normalization_78", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 167], "dtype": "float32", "keras_history": ["conv1d_96", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_29", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "name": "re_lu_29", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 167], "dtype": "float32", "keras_history": ["batch_normalization_78", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_97", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 167, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "LecunUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 365, 167]}, "name": "conv1d_97", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 167], "dtype": "float32", "keras_history": ["re_lu_29", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_12", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 365, 167], [null, 365, 167]]}, "name": "add_12", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 167], "dtype": "float32", "keras_history": ["re_lu_29", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 167], "dtype": "float32", "keras_history": ["conv1d_97", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_98", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 235, "kernel_size": [10], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "LecunUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 365, 167]}, "name": "conv1d_98", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 167], "dtype": "float32", "keras_history": ["add_12", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_79", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false, "renorm": false, "renorm_clipping": null, "renorm_momentum": 0.99}, "registered_name": null, "build_config": {"input_shape": [null, 365, 235]}, "name": "batch_normalization_79", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 235], "dtype": "float32", "keras_history": ["conv1d_98", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_30", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "name": "re_lu_30", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 235], "dtype": "float32", "keras_history": ["batch_normalization_79", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_99", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 235, "kernel_size": [10], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "LecunUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 365, 235]}, "name": "conv1d_99", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 235], "dtype": "float32", "keras_history": ["re_lu_30", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_80", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false, "renorm": false, "renorm_clipping": null, "renorm_momentum": 0.99}, "registered_name": null, "build_config": {"input_shape": [null, 365, 235]}, "name": "batch_normalization_80", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 235], "dtype": "float32", "keras_history": ["conv1d_99", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_31", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "name": "re_lu_31", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 235], "dtype": "float32", "keras_history": ["batch_normalization_80", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_100", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 235, "kernel_size": [10], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "LecunUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 365, 235]}, "name": "conv1d_100", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 235], "dtype": "float32", "keras_history": ["re_lu_31", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_81", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false, "renorm": false, "renorm_clipping": null, "renorm_momentum": 0.99}, "registered_name": null, "build_config": {"input_shape": [null, 365, 235]}, "name": "batch_normalization_81", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 235], "dtype": "float32", "keras_history": ["conv1d_100", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_32", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "name": "re_lu_32", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 235], "dtype": "float32", "keras_history": ["batch_normalization_81", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv1D", "config": {"name": "conv1d_101", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 235, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "LecunUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 365, 235]}, "name": "conv1d_101", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 235], "dtype": "float32", "keras_history": ["re_lu_32", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_13", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 365, 235], [null, 365, 235]]}, "name": "add_13", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 235], "dtype": "float32", "keras_history": ["re_lu_32", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 235], "dtype": "float32", "keras_history": ["conv1d_101", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "data_format": "channels_last", "keepdims": false}, "registered_name": null, "name": "global_average_pooling1d_4", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 365, 235], "dtype": "float32", "keras_history": ["add_13", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}, "registered_name": null, "build_config": {"input_shape": [null, 235]}, "name": "dense_11", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 235], "dtype": "float32", "keras_history": ["global_average_pooling1d_4", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "activation_48", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "softmax"}, "registered_name": null, "name": "activation_48", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 2], "dtype": "float32", "keras_history": ["dense_11", 0, 0]}}], "kwargs": {}}]}], "input_layers": ["input_layer_9", 0, 0], "output_layers": ["activation_48", 0, 0]}, "registered_name": "Functional", "build_config": {"input_shape": null}, "compile_config": {"optimizer": {"module": "keras.optimizers", "class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0023889027070254087, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}, "registered_name": null}, "loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["AUC"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false}}